---
title: IndexBuffer
classe: Autodesk.Revit.DB.DirectContext3D.IndexBuffer
namespace: Autodesk.Revit.DB.DirectContext3D
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# IndexBuffer

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `indexBuffer.IsValidObject` | Boolean |
| `Void Dispose()` | `indexBuffer.Dispose()` | Void |
| `IndexStreamLine GetIndexStreamLine()` | `indexBuffer.GetIndexStreamLine()` | IndexStreamLine |
| `IndexStreamPoint GetIndexStreamPoint()` | `indexBuffer.GetIndexStreamPoint()` | IndexStreamPoint |
| `IndexStreamTriangle GetIndexStreamTriangle()` | `indexBuffer.GetIndexStreamTriangle()` | IndexStreamTriangle |
| `IntPtr GetMappedHandle()` | `indexBuffer.GetMappedHandle()` | IntPtr |
| `Boolean IsValid()` | `indexBuffer.IsValid()` | Boolean |
| `Void Map(Int32)` | `indexBuffer.Map(sizeInShortInts)` | Void |
| `Void Unmap()` | `indexBuffer.Unmap()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```